////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
console.log(`
+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
Array.isArray(obj)
+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++`);
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
console.log(Array.isArray([])); // true
console.log(Array.isArray(new Array(7))); // true
console.log(Array.isArray({})); // false
console.log(Array.isArray('array')); // false

const arr = [1, 2, 3, 4, 5];
console.log(arr instanceof Array);

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
console.log(`
+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
Array.join([separator])
+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++`);
// Метод join() объединяет все элементы массива (или массивоподобного объекта) в строку.
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
const elements = ['Fire', 'Air', 'Water'];

console.log(elements.join()); // expected output: "Fire,Air,Water"
console.log(elements.join('')); // expected output: "FireAirWater"
console.log(elements.join('-')); // expected output: "Fire-Air-Water"

function f(a, b, c) {
    const s = Array.prototype.join.call(arguments);
    console.log(s); // '1,a,true'
}

f(1, 'a', true);

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
console.log(`
+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
Array.reverse()
+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++`);
// Метод reverse() на месте обращает порядок следования элементов массива. Первый элемент массива становится последним,
// а последний — первым.
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
const array1 = ['one', 'two', 'three'];
console.log('array1: ', array1); // expected output: Array ['one', 'two', 'three']

const reversed = array1.reverse();
console.log('reversed: ', reversed); // expected output: Array ['three', 'two', 'one']

/* Careful: reverse is destructive. It also changes the original array */
console.log('array1: ', array1); // expected output: Array ['three', 'two', 'one']

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
console.log(`
+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++`);
//
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////





































